import React from 'react';

const TermsOfService = () => {
  return (
    <div className="form-container">
      <section className="text-black bg-white min-h-screen body-font">
        <div className="container mx-auto px-5 py-14">
          <div className="text-left">
            <h1 className="text-3xl font-bold mb-2">ユーザー登録</h1>
            <p className="mb-4 text-lg">以下のいずれかの事由があると判断した場合、利用登録の申請を承認しないことがあります。本サービスでは登録拒否の理由について一切の開示義務を負いません。</p>
            <ul className="list-disc pl-5 mb-6">
              <li>虚偽の事項を届け出た場合</li>
              <li>本規約に違反したことがある者からの申請である場合</li>
              <li>その他、利用登録を相当でないと判断した場合</li>
            </ul>
            <h1 className="text-3xl font-bold mb-2">ログイン情報の管理</h1>
            <p className="mb-4">ユーザーは、自己の責任において、本サービスのログイン情報を適切に管理するものとします。ユーザーは、いかなる場合にも、ログイン情報を第三者に譲渡または貸与し、もしくは第三者と共用することはできません。ログイン情報が第三者によって使用されたことによって生じた損害につき、本サービスに重大な過失がある場合を除き、一切の責任を負いません。</p>

            <h1 className="text-3xl font-bold mb-2">未成年による利用</h1>
            <p className="mb-4">ユーザーが未成年である場合には、法定代理人の同意を得た上で、本サービスを利用してください。法定代理人の同意を得ずに本サービスのご利用を開始したユーザーが成年に達した場合、未成年者であった間の利用行為を追認したものとみなします。</p>

            <h1 className="text-3xl font-bold mb-2">ユーザーの投稿</h1>
              <ul className="list-disc pl-5 mb-6">
                <li>ユーザーは、ユーザーの投稿に含まれる情報を送信することについて適法な権利を有していること、及びユーザーの投稿が第三者の知的財産権（著作権、特許権、実用新案権、商標権、意匠権（それらの権利を取得し、又はそれらの権利につき登録等を出願する権利を含みます。）又はアイデア、ノウハウ等をいい、以下同様とします。）、所有権その他の権利を侵害していないことについて、本サービスに対し表明し、保証するものとします。</li>
                <li>ユーザーの投稿に関する著作権は、ユーザー自身に留保されます。当社はユーザーの投稿に関して著作権を取得することはありません。ただし、当社は、本サービスの提供、維持、改善又は本サービスのプロモーションに必要な範囲において、無償、無期限かつ地域非限定で、ユーザーの投稿を複製、翻案、自動公衆送信及びそのために必要な送信可能化をすることができるものとします。この場合、ユーザーは、当社および当社から権利を承継し又は許諾されたものに対し著作者人格権を行使しないものとします。</li>
              </ul>

            <h1 className="text-3xl font-bold mb-2">投稿を禁止するコンテンツ</h1>
              <ul className="list-disc pl-5 mb-6">
                <li>本サービス又は第三者の知的財産権、肖像権、プライバシー、名誉、その他の権利又は利益を侵害する情報</li>
                <li>ユーザーを特定可能な個人情報等を含む情報(ただし、利用登録に必要な場合等本サービスで求めた場合、その他本サービスで認めた場合を除きます。)</li>
                <li>わいせつな表現を含む情報</li>
                <li>異性、同性を問わず、面識のない第三者との出会い又はわいせつな行為等を目的とする情報</li>
                <li>自殺、自傷行為を誘引、勧誘又は助長する表現を含む情報</li>
                <li>薬物·危険ドラッグの売買に関する情報又は薬物危険ドラッグの不適切な利用を助長する表現を含む情報</li>
                <li>宗教的行為、宗教団体、政治的活動、政治団体の宣伝又は広告に関する情報</li>
                <li>ネットワークビジネス関連の勧誘等に関する情報</li>
                <li>ジャンクメール、スパムメールに相当する文面を含む情報</li>
                <li>未成年者に悪影響を及ぼすおそれのある情報</li>
                <li>残虐な表現その他他人に不快感を与えるおそれのある情報</li>
                <li>コンピュータウイルス等の不正プログラムを含む情報</li>
                <li>その他当社が不適切と判断する情報</li>
              </ul>
            <h1 className="text-3xl font-bold mb-2">利用制限</h1>
            <p className="mb-4">ユーザーが以下のいずれかに該当する場合には、事前の通知なく、ユーザーに対して、本サービスの全部もしくは一部の利用を制限し、またはユーザーとしての登録を抹消することができるものとします。本条に基づき本サービスが行った行為によりユーザーに生じた損害について、一切の責任を負いません。</p>
              <ul className="list-disc pl-5 mb-6">
                <li>本規約のいずれかの条項に違反した場合</li>
              </ul>

            <h1 className="text-3xl font-bold mb-2">禁止事項</h1>
              <ul className="list-disc pl-5 mb-6">
                <li>法令、裁判所の判決、決定若しくは命令、又は法令上拘束力のある行政措置に違反する行為又はこれらを助長する行為</li>
                <li>犯罪行為に関連する行為</li>
                <li>本サービスや第三者の知的財産権を侵害する行為</li>
                <li>当社や第三者の肖像権、プライバシー、名誉、その他の権利又は利益を侵害する行為</li>
                <li>本サービスや第三者のサーバーまたはネットワークに過度の負担をかけたり、その正常な作動を妨害する行為</li>
                <li>本サービスの運営を妨害するおそれのある行為</li>
                <li>不正アクセスをし、またはこれを試みる行為</li>
                <li>本サービスに接続しているシステムに権限なく不正にアクセスし情報を不正に書き換え若しくは消去する行為</li>
                <li>本サービス上のアカウント又はコンテンツを第三者に有償で貸与、譲渡、売買等をする行為</li>
                <li>他のユーザーのアカウントを利用する行為</li>
                <li>反社会的勢力に対して直接または間接に利益を供与する行為</li>
                <li>公序良俗に違反する行為</li>
                <li>その他、本サービスの運営が不適切と判断する行為</li>
              </ul>
            <h1 className="text-3xl font-bold mb-2">免責</h1>
            <p className="mb-4">本サービスに関してユーザーに生じたあらゆる損害について一切の責任を負いません。ただし、本サービスに関す運営とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。</p>
            <p className="mb-4">消費者契約に該当する場合であっても、本サービス運営の過失（重過失を除きます。）によってユーザーに生じた損害のうち特別の事情から生じた損害（運営またはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について、一切の責任を負いません。ユーザーと他のユーザーまたは第三者との間において生じたトラブルについても一切責任を負いません。</p>
            <p className="mb-4">本サービス運営は、本サービスに関してユーザーが被った損害につき、当該損害が発生した月内にユーザーが当社に支払った利用料金を超えて賠償する責任を負わないものとします。</p>
          </div>
        </div>
      </section>
    </div>
  )
};

export default React.memo(TermsOfService);